In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
import sys
sys.path.append("../")
from src.functions import *
#importo las funciones de mi archivo de funciones

In [3]:
attacks = pd.read_csv("Data/attacks.csv") 
#hago una copia de la base de datos original para trabajar sobre ella
attacks_2 = attacks.copy()

In [4]:
columnas = list(attacks_2.columns)
columnas

['Case Number',
 'Date',
 'Year',
 'Type',
 'Country',
 'Area',
 'Location',
 'Activity',
 'Name',
 'Sex ',
 'Age',
 'Injury',
 'Fatal (Y/N)',
 'Time',
 'Species ',
 'Investigator or Source',
 'pdf',
 'href formula',
 'href',
 'Case Number.1',
 'Case Number.2',
 'original order',
 'Unnamed: 22',
 'Unnamed: 23']

In [5]:
dict_columns = columns_name(columnas)
dict_columns

{'Case Number': 'case_number',
 'Date': 'date',
 'Year': 'year',
 'Type': 'type',
 'Country': 'country',
 'Area': 'area',
 'Location': 'location',
 'Activity': 'activity',
 'Name': 'name',
 'Sex ': 'sex_',
 'Age': 'age',
 'Injury': 'injury',
 'Fatal (Y/N)': 'fatal_(y/n)',
 'Time': 'time',
 'Species ': 'species_',
 'Investigator or Source': 'investigator_or_source',
 'pdf': 'pdf',
 'href formula': 'href_formula',
 'href': 'href',
 'Case Number.1': 'case_number.1',
 'Case Number.2': 'case_number.2',
 'original order': 'original_order',
 'Unnamed: 22': 'unnamed:_22',
 'Unnamed: 23': 'unnamed:_23'}

In [6]:
attacks_2.rename(columns = dict_columns, inplace=True)
attacks_2.columns

Index(['case_number', 'date', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'sex_', 'age', 'injury', 'fatal_(y/n)', 'time',
       'species_', 'investigator_or_source', 'pdf', 'href_formula', 'href',
       'case_number.1', 'case_number.2', 'original_order', 'unnamed:_22',
       'unnamed:_23'],
      dtype='object')

In [7]:
attacks_2.drop(columns=["unnamed:_22","unnamed:_23","pdf", "href_formula", "href", "case_number.1", "case_number.2"], inplace=True)
#elimino las columnas Unnamed 23 y 23 ya que prácticamente todos sus datos son nulos
attacks_2.columns

Index(['case_number', 'date', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'sex_', 'age', 'injury', 'fatal_(y/n)', 'time',
       'species_', 'investigator_or_source', 'original_order'],
      dtype='object')

In [8]:
attacks_2.shape #inspecciono la forma de la base de datos

(25723, 17)

In [9]:
attacks_2.drop_duplicates() #elimino los duplicados
attacks_2.shape 
#al comprobar la forma al eliminar los duplicados vemos que no hay datos duplicados

(25723, 17)

In [10]:
attacks_2.dropna(how="all", inplace=True)
'''Elimino las filas en las que todos sus valores son nulos'''
attacks_2.shape

(8703, 17)

In [11]:
'''Inspecciono el número de NaN por columna'''
attacks_2.isna().sum()

case_number                  1
date                      2401
year                      2403
type                      2405
country                   2451
area                      2856
location                  2941
activity                  2945
name                      2611
sex_                      2966
age                       5232
injury                    2429
fatal_(y/n)               2940
time                      5755
species_                  5239
investigator_or_source    2418
original_order            2394
dtype: int64

In [12]:
attacks_2["month"] = attacks_2["date"].str.extract(r'([A-Z][a-z][\w+-])')
'''Creo una columna nueva con los meses que la extraigo de Date'''
attacks_2.sample(5)

,case_number,date,year,type,country,area,location,activity,name,sex_,age,injury,fatal_(y/n),time,species_,investigator_or_source,original_order,month
7814,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8539,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1413,2006.12.11,11-Dec-2006,2006.0,Unprovoked,NEW ZEALAND,North Island,"Raglan, Manu Bay",Surfing,Elliot Paerata-Reid,M,10,Foot bitten,N,11h00,2 to 3 m shark,"R.D. Weeks, GSAF",4890.0,Dec
2699,1989.01.08,08-Jan-1989,1989.0,Unprovoked,USA,Hawaii,"Wailua, Kaua'i",Swimming in strong current with 3 others when ...,Ken Ahlstrand,M,NaN,"Lower part of body found 6 days later, x-rays ...",Y,NaN,NaN,"J. Borg, p.77; L. Taylor (1993), pp.106-107",3604.0,Jan
8391,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
attacks_2.month.value_counts().head()

Jul    596
Rep    550
Aug    542
Sep    493
Jan    463
Name: month, dtype: int64

In [14]:
month_lst = ["Jan", "Feb", "Mar", "May", "Apr", "Jun", "Jul", "Aug", "Sep", "Oct", "Nov", "Dec"]
attacks_2["month"].fillna("unknown", inplace = True)
#convierto los NaN en "unknown"
attacks_2["month"] = attacks_2["month"].apply(cambio)
#convierto los datos no válidos en "unknown"      
attacks_2.sample(5)

,case_number,date,year,type,country,area,location,activity,name,sex_,age,injury,fatal_(y/n),time,species_,investigator_or_source,original_order,month
5902,1871.12.11.R,Reported 11-Dec-1871,1871.0,Invalid,AUSTRALIA,New South Wales,Hawkesbury River,NaN,male,M,NaN,Human remains recovered from 11' shark,NaN,NaN,Shark involvement prior to death unconfirmed,"Border Watch, 1/10/1872",401.0,unknown
5173,1925.00.00,1925,1925.0,Unprovoked,FIJI,Viti Levu Island,"Suva Harbor, Suva",Diving for coins tossed from passenger ship,Fijian boy,M,NaN,"Both arms bitten, surgically amputated",N,NaN,NaN,"V.M. Coppleson (1958), p.258",1130.0,unknown
5508,1904.07.27,27-Jul-1904,1904.0,Unprovoked,USA,Texas,NaN,Swimming,Chester Kennedy,M,NaN,"FATAL, body not recovered",Y,NaN,NaN,"New York Times, 7/28/1904",795.0,Jul
3070,1980.03.28,28-Mar-1980,1980.0,Unprovoked,BRAZIL,Rio de Janeiro,"Copacabana Beach, Rio de Janiero",Swimming,J.M.,M,NaN,Right leg bitten,N,Afternoon,2 m shark,M. Szpilman,3233.0,Mar
992,2010.09.03.a,03-Sep-2010,2010.0,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,Andrew Heald,M,24,Left thigh bitten,N,09h00,NaN,"S. Petersohn; M. Johnson, Daytona B...",5311.0,Sep

In [15]:
attacks_2.month.value_counts()

unknown    3505
Jul         596
Aug         542
Sep         493
Jan         463
Jun         441
Apr         408
Oct         402
Dec         391
Mar         379
Nov         374
May         360
Feb         349
Name: month, dtype: int64

In [16]:
attacks_month = attacks_2[["month", "country"]][(attacks_2["month"]!="unknown")]
#creo un data frame con los valores válidos, eliminando los "unknown"
attacks_month

     month       country
0      Jun           USA
1      Jun           USA
2      Jun           USA
3      Jun     AUSTRALIA
4      Jun        MEXICO
...    ...           ...
6151   Jul           USA
6155   Dec           NaN
6159   Jun         ITALY
6160   Mar      BARBADOS
6289   Jul  SOUTH AFRICA

[5198 rows x 2 columns]

In [17]:
attacks_month["month"] = pd.to_datetime(attacks_month["month"], errors="coerce", format = "%b")
attacks_month["month"] = pd.DatetimeIndex(attacks_month['month']).month_name()
attacks_month = attacks_month.sort_values(by="month")
'''Ordeno la base de datos en funcióin de los meses'''
attacks_month.sample(5)

         month           country
3160  December               USA
695      March      SOUTH AFRICA
5406  February         AUSTRALIA
401       June      SOUTH AFRICA
4275  November  PAPUA NEW GUINEA

In [18]:
attacks_month["country"] = attacks_month["country"].str.lower().str.strip()
'''Con esto limpiamos los paises ya que había algunos datos escritos de forma diferente'''
attacks_month["country"].unique()

array(['usa', 'mauritius', 'reunion', 'australia', 'pacific ocean',
       'south africa', 'mozambique', 'marshall islands', 'new zealand',
       'indonesia', 'nicaragua', 'italy', 'honduras', 'fiji', 'mexico',
       'persian gulf', 'brazil', 'cape verde', 'new caledonia',
       'french polynesia', 'sudan', 'philippines', 'jamaica', 'venezuela',
       'solomon islands', nan, 'grenada', 'united kingdom', 'guam',
       'palau', 'south atlantic ocean', 'western samoa', 'indian ocean',
       'panama', 'tonga', 'papua new guinea', 'china', 'bahamas',
       'st helena, british overseas territory', 'cuba', 'maldives',
       'costa rica', 'india', 'nigeria', 'thailand', 'tobago', 'greece',
       'taiwan', 'sudan?', 'vanuatu', 'japan', 'egypt', 'iran', 'bermuda',
       'spain', 'senegal', 'malta', 'england', 'saudi arabia',
       'el salvador', 'belize', 'south korea', 'croatia', 'new britain',
       'iceland', 'scotland', 'canada', 'turkey', 'russia', 'israel',
       'seychelles', 'north atlantic ocean', 'american samoa',
       'iran / iraq', 'dominican republic', 'samoa', 'hong kong', 'yemen',
       'madagascar', 'atlantic ocean', 'france', 'guyana', 'tanzania',
       'haiti', 'columbia', 'malaysia', 'singapore',
       'british virgin islands', 'ecuador', 'chile', 'micronesia',
       'south china sea', 'portugal', 'sri lanka', 'johnston island',
       'maldive islands', 'kenya', 'guatemala', 'aruba', 'guinea',
       'north pacific ocean', 'kiribati', 'turks & caicos',
       'trinidad & tobago', 'tasman sea', 'vietnam', 'caribbean sea',
       'sierra leone', 'united arab emirates', 'uruguay', 'argentina',
       'new guinea', 'united arab emirates (uae)', 'montenegro',
       'the balkans', 'namibia', 'ireland', 'georgia', 'falkland islands',
       'java', 'federated states of micronesia', 'okinawa', 'norway',
       'diego garcia', 'egypt / israel', 'comoros', 'liberia',
       'south pacific ocean', 'north sea', 'mid atlantic ocean',
       'british isles', 'puerto rico', 'lebanon', 'netherlands antilles',
       'martinique', 'cook islands', 'cayman islands', 'paraguay',
       'barbados', 'somalia', 'bangladesh', 'iraq', 'central pacific',
       'palestinian territories', 'red sea', 'coast of africa',
       'solomon islands / vanuatu', 'azores', 'ghana', 'san domingo',
       'northern arabian sea', 'admiralty islands', 'gulf of aden',
       'st. maartin', 'grand cayman', 'peru', 'red sea / indian ocean',
       'british west indies', 'nevis', 'mayotte',
       'southwest pacific ocean', 'andaman / nicobar islandas'],
      dtype=object)

In [19]:
attacks_month.info()
'''
Ahora tenemos attacks_month lista para trabajar nuestra hipótesis y la exportamos
'''

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5198 entries, 2603 to 1323
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   month    5198 non-null   object
 1   country  5174 non-null   object
dtypes: object(2)
memory usage: 121.8+ KB

'\nAhora tenemos attacks_month lista para trabajar nuestra hipótesis y la exportamos\n'

In [20]:
attacks_month.to_csv("Data/attacks_month.csv", index=False)

In [21]:
attacks_month.month.unique()

array(['April', 'August', 'December', 'February', 'January', 'July',
       'June', 'March', 'May', 'November', 'October', 'September'],
      dtype=object)

In [22]:
attacks_year =  attacks_2.groupby(['year']).agg({'month':'count'}).reset_index().rename(columns={'month':"total"})
attacks_year = attacks_year[attacks_year['year'] > 1900]
attacks_year.to_csv("Data/attacks_year.csv", index=False)
attacks_year.sample(5)

       year  total
205  1975.0     49
140  1910.0     14
210  1980.0     35
193  1963.0     61
231  2001.0     92